legio-e/BasicPlus/bpgenvm-c/esp32p4/main/main.c
/*
 * BasicPlus — ESP32-P4: VM.3 — "Run on P4" desde el IDE (wire v1 sobre TCP).
 *
 * Sobre el bring-up de red (Ethernet IP101 + IP estática 192.168.2.2) y la
 * VM-C ya verificada en RISC-V (VM.1/VM.2), el P4 pasa de ejecutar un módulo
 * EMBEBIDO a ser un TARGET de desarrollo: levanta un SERVIDOR del wire BPVM v1
 * sobre TCP y el IDE (backend "VM (TCP v1)") sube/ejecuta apps arbitrarias.
 *
 * Dos canales TCP, independientes:
 *   - P4 -> PC 192.168.2.1:5555  (cliente)  = log de bring-up (net_logf), para
 *     ver el lado servidor con pc_logserver.py por si hay líos de comms.
 *   - IDE -> P4 *:3333           (servidor) = wire v1 (HELLO/PUT/RUN/KILL...).
 *     El dispatcher es repl_esp32.c REUTILIZADO TAL CUAL (agnóstico del
 *     transporte); el I/O de bytes va por wire_v1_tcp.c (sockets lwIP).
 *
 * Compila/flashea Eduardo (idf.py). sdkconfig.defaults trae el fix de
 * revisión de silicon v1.0.
 */
#include <stdio.h>
#include <string.h>
#include <stdarg.h>
#include <stdlib.h>           /* abort() si la reserva PSRAM falla */
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/event_groups.h"
#include "esp_netif.h"
#include "esp_eth.h"
#include "esp_event.h"
#include "board_mgr_esp32.h"   /* H9: arranque escalonado + estado del boot */
#include "log.h"               /* log persistente (post-mortem) — lo antes posible */
#include "bpvm.h"              /* #353: bpvm_diag_set_sink — el rastro de la VM al log */
#include "bpvm_sqlmem.h"       /* V5/H7: la REGLA del bloque de la BD (un solo sitio) */
#include "bpvm_env.h"          /* V5/H7: SQLite=<MB> del entorno */
#include "bpvm_bios.h"         /* V5/H7: la tabla que se le presta al pack */
#include "pack_p4.h"           /* V5/H7: PACK_RAM_BYTES + s_pack_ram_base + bios_p4_get */
#include "esp_log.h"
#include "esp_timer.h"
#include "esp_heap_caps.h"
#include "bpvm_mem.h"           /* V6/U6: el planificador comun de memoria */   /* heap_caps_malloc: heap de la VM en PSRAM */
#include "lwip/sockets.h"
#include "lwip/inet.h"

#include "fs.h"               /* FS-RAM (VM.2b) + fs_register_bpvm (#247) */
#include "esp32_mods.h"       /* stdlib embebida (14 mods, compartida con el S3) -> /lib */
#include "repl_esp32.h"       /* dispatcher wire v1 REUTILIZADO (agnóstico transporte) */
#include "wire_v1_tcp.h"      /* servidor del wire sobre TCP (capa de I/O del P4) */
#include "p4_board_id.h"      /* identidad de placa esp32p4 para INFO/HELLO */
#include "gui_display_dsi.h"  /* G3: display MIPI-DSI (panel + backlight + rojo) */
#include "hw_esp32.h"         /* H14: backends HW (GPIO/UART/SPI/I2C) reusados del S3 */
#include "bpvm_blk_sdmmc.h"   /* V5/H6: la SD por SDIO como dispositivo de bloque */
#include "blk_sdmmc_p4.h"     /* SDIO_KHZ_POR_DEFECTO: para ANUNCIAR el reloj de verdad */
#include "bpvm_fs_fat.h"      /* V5/H6: montar esa tarjeta como FAT bajo /sd      */

static const char *TAG = "bpvm_p4";

#define SERVER_IP    "192.168.2.1"
#define SERVER_PORT  5555           /* log de bring-up (P4 cliente -> PC) */
#define WIRE_PORT    3333           /* wire v1 (IDE cliente -> P4 servidor) */
#define LINK_UP_BIT  BIT0

/* Memoria de la VM (caller-provided). repl_esp32.c la referencia como extern
 * (PUNTERO, misma convención que el S3 y la Pico/Metro). En el P4 el heap de la
 * VM vive en PSRAM (32 MB in-package, HEX@200 MHz → baja penalización): se
 * reserva en vm_buffer_init_psram() antes de arrancar las tasks. El P4 SIEMPRE
 * lleva PSRAM (el framebuffer del display también la usa). */
/* H9 — reparto de la PSRAM (Eduardo 19-jul): ~4 MB reservados para el framebuffer
 * del display (LVGL reserva ON-DEMAND, más tarde, cuando un .mod usa Gui.*), y
 * TODO EL RESTO para el heap de la VM. Se calcula en runtime (free PSRAM − reserva)
 * → auto-adapta a la PSRAM real (16/32 MB) sin hornear el tamaño. Antes: 2 MiB fijos. */
#define VM_PSRAM_DISPLAY_RESERVE  (4u * 1024u * 1024u)   /* margen para LVGL */
#define VM_MEM_MIN                (2u * 1024u * 1024u)    /* piso si algo va mal */
uint8_t*       s_vm_buffer      = NULL;
uint32_t       s_vm_buffer_size = 0;

/* V5/H7 — el bloque de la BD (SQLite), mordido de la PSRAM ANTES que el heap de
 * la VM. Los lee `bios_p4.c` para servir la arena. NULL/0 = no se pidió o no cupo. */
uint8_t*       s_sqlite_base    = NULL;
uint32_t       s_sqlite_size    = 0;
static int     s_sqlite_res     = 0;      /* bpvm_sqlite_res_t, para el INFO */
static long    s_sqlite_asked_mb = 0;

static EventGroupHandle_t s_events;   /* gate de Link Up (Ethernet — ambos transportes) */
static int s_sock = -1;     /* socket del canal de log (lo usa net_logf, común) */

/* Log instrumentado: a consola (idf.py monitor) Y al socket TCP de log. El
 * caller NO pone '\n' final; lo añade esta función para el lado TCP. NO static:
 * wire_v1_tcp.c lo usa por extern para trazar accept/disconnect/errores. */
void net_logf(const char *fmt, ...)
{
    char buf[200];
    va_list ap;
    va_start(ap, fmt);
    int n = vsnprintf(buf, sizeof(buf) - 2, fmt, ap);
    va_end(ap);
    if (n < 0) return;
    if (n > (int) sizeof(buf) - 2) n = sizeof(buf) - 2;
    ESP_LOGI(TAG, "%s", buf);
    buf[n++] = '\n';
    if (s_sock >= 0) send(s_sock, buf, n, 0);
}

/* ===================================================================
 * CANAL DE LOG POR RED (net_logf → 192.168.2.1:5555) — APAGADO EN V4
 * ===================================================================
 * Viene del bring-up del P4, cuando el enlace con el IDE era por Ethernet.
 * Después se añadió el transporte por UART0 (#138) para que UNA MISMA IMAGEN
 * sirviera a las dos placas P4 —la del kit, con Ethernet, y la Waveshare, que no
 * lo tiene— y desde entonces la red aquí sólo alimentaba ese canal de
 * diagnóstico. Es historia, no una función del producto.
 *
 * Lo que costaba en la imagen que se publica (transporte UART, el de por
 * defecto): `wire_task_uart` esperaba hasta CINCO SEGUNDOS a que subiera el
 * enlace para que esos logs llegaran. En la Waveshare, sin PHY, ese enlace no
 * sube NUNCA → cinco segundos de retraso en CADA encendido, esperando un canal
 * que nadie escucha.
 *
 * Se apaga con un interruptor y NO se borra: publicamos las fuentes, así que
 * quien lo quiera compila con -DBPVM_P4_NETLOG=1 y lo tiene entero. Se prefirió
 * el interruptor a comentar las líneas por una razón concreta: comentando sólo
 * las llamadas quedan cuatro funciones estáticas sin usar, y este proyecto
 * compila con -Werror → no enlazaría. Así el código sigue vivo y compilable.
 *
 * OJO: el wire por TCP (BPVM_P4_WIRE=tcp) SÍ necesita la red. Hay un #error
 * abajo que lo dice en vez de dejarte un binario que no conecta.
 * =================================================================== */
#ifndef BPVM_P4_NETLOG
#define BPVM_P4_NETLOG 0
#endif
#if defined(BPVM_P4_WIRE_TCP) && !BPVM_P4_NETLOG
#error "BPVM_P4_WIRE=tcp necesita la red: compila tambien con -DBPVM_P4_NETLOG=1"
#endif

#if BPVM_P4_NETLOG
/* ===== Ethernet — COMÚN a ambos transportes. En TCP lleva el wire (:3333); en
 * UART lleva SOLO los logs (net_logf → :5555) como red de seguridad. (Init
 * verificada en bring-up: IP101 / RMII, pines EV board.) ===== */
static esp_err_t eth_init(esp_eth_handle_t *out)
{
    eth_mac_config_t mac_config = ETH_MAC_DEFAULT_CONFIG();
    eth_phy_config_t phy_config = ETH_PHY_DEFAULT_CONFIG();
    phy_config.phy_addr = 1;
    phy_config.reset_gpio_num = 51;

    eth_esp32_emac_config_t emac_cfg = ETH_ESP32_EMAC_DEFAULT_CONFIG();
    emac_cfg.smi_gpio.mdc_num  = 31;
    emac_cfg.smi_gpio.mdio_num = 52;

