legio-e/BasicPlus/bpgenvm-c/esp32p4/main/main.c
    esp_eth_mac_t *mac = esp_eth_mac_new_esp32(&emac_cfg, &mac_config);
    if (mac == NULL) { ESP_LOGE(TAG, "MAC failed"); return ESP_FAIL; }
    esp_eth_phy_t *phy = esp_eth_phy_new_generic(&phy_config);
    if (phy == NULL) { ESP_LOGE(TAG, "PHY failed"); mac->del(mac); return ESP_FAIL; }
    esp_eth_config_t config = ETH_DEFAULT_CONFIG(mac, phy);
    return esp_eth_driver_install(&config, out);
}

static void eth_event_handler(void *arg, esp_event_base_t base,
                              int32_t id, void *data)
{
    (void) arg; (void) base; (void) data;
    switch (id) {
    case ETHERNET_EVENT_CONNECTED:
        ESP_LOGI(TAG, "Ethernet Link Up");
        xEventGroupSetBits(s_events, LINK_UP_BIT);
        break;
    case ETHERNET_EVENT_DISCONNECTED:
        ESP_LOGI(TAG, "Ethernet Link Down");
        xEventGroupClearBits(s_events, LINK_UP_BIT);
        break;
    case ETHERNET_EVENT_START: ESP_LOGI(TAG, "Ethernet Started"); break;
    case ETHERNET_EVENT_STOP:  ESP_LOGI(TAG, "Ethernet Stopped"); break;
    default: break;
    }
}

static void got_ip_handler(void *arg, esp_event_base_t base,
                           int32_t id, void *data)
{
    (void) arg; (void) base; (void) id;
    ip_event_got_ip_t *e = (ip_event_got_ip_t *) data;
    ESP_LOGI(TAG, "Got IP: " IPSTR, IP2STR(&e->ip_info.ip));
}

/* ---- Canal de log de bring-up: P4 cliente -> pc_logserver.py:5555 ----
 * Solo diagnóstico (el wire lleva la salida de los programas al IDE). Si el PC
 * no escucha, reintenta; el firmware funciona igual sin él. */
static void tcp_log_task(void *arg)
{
    (void) arg;
    xEventGroupWaitBits(s_events, LINK_UP_BIT, pdFALSE, pdTRUE, portMAX_DELAY);
    vTaskDelay(pdMS_TO_TICKS(500));

    while (1) {
        int sock = socket(AF_INET, SOCK_STREAM, IPPROTO_TCP);
        if (sock < 0) { vTaskDelay(pdMS_TO_TICKS(2000)); continue; }
        struct sockaddr_in dest = {0};
        dest.sin_family = AF_INET;
        dest.sin_port = htons(SERVER_PORT);
        dest.sin_addr.s_addr = inet_addr(SERVER_IP);

        if (connect(sock, (struct sockaddr *) &dest, sizeof(dest)) == 0) {
            s_sock = sock;
            net_logf("[p4] canal de log conectado a %s:%d (bring-up)", SERVER_IP, SERVER_PORT);
            int n = 0;
            while (1) {
                net_logf("[p4] idle %d uptime=%lld ms", n++,
                         (long long)(esp_timer_get_time() / 1000));
                vTaskDelay(pdMS_TO_TICKS(5000));
                if (send(sock, "", 0, 0) < 0) break;   /* detecta caída del log */
            }
            s_sock = -1;
        }
        close(sock);
        vTaskDelay(pdMS_TO_TICKS(2000));
    }
}

#endif  /* BPVM_P4_NETLOG */

/* ---------------------------------------------------------------------------
 * V5/H6 — la tarjeta SD, si el env la configura.
 *
 * AQUI y no antes: /sd se monta ENCIMA de la fachada, y sin el FS de la placa no
 * hay donde colgarlo. Y antes del autoarranque, para que una app encuentre la
 * tarjeta ya montada.
 *
 * Lo llaman los DOS caminos de arranque (TCP y UART) desde una sola funcion, que
 * es lo que evita el clasico "lo arregle en uno y me olvide del otro".
 *
 * (!) A diferencia de la Metro, el zocalo del P4 NO tiene deteccion de tarjeta
 * (~CD solo lleva su pull-up, leido del esquema), asi que NO se usa
 * `bpvm_fs_fat_vigilar`: esa funcion se rearma en la rama "no hay medio", que
 * aqui no se ejecutaria nunca, y quedaria dando UN intento por arranque sin
 * decir por que. En esta placa el montaje es explicito.
 *
 * (!) Que falle NO degrada el arranque. Una tarjeta ilegible, ausente o en exFAT
 * es un accesorio que no va, no una placa rota: se anota el motivo y se sigue.
 * Degradar el boot por esto dejaria al usuario sin IDE justo cuando mas falta
 * hace para averiguar que pasa.
 *
 * (!) Va por `log_printf` y NO por `net_logf`: el segundo escribe a la consola
 * del IDF y al socket de log por red, que esta APAGADO por defecto. El log que
 * de verdad se mira -el persistente, el que sobrevive a un cuelgue y el que
 * enseña el IDE- es el de `log_printf`, y es donde estan las demas lineas del
 * arranque. Un chivato en el canal equivocado es un chivato mudo.
 * ------------------------------------------------------------------------- */
static void p4_montar_sd(void)
{
    char linea[160];
    int n = bpvm_env_get(board_mgr_env(), "sd", linea, sizeof linea);
    if (n <= 0) { log_printf("sd: sin configurar en el env - no se monta"); return; }

    bpvm_sdio_pines_t pines;
    char motivo[120];
    if (bpvm_sdio_pines_parse(linea, &pines, motivo, sizeof motivo) != 0) {
        log_printf("sd: %s", motivo);         /* el parser ya dice QUE falta */
        return;
    }
    /* La CONFIGURACION que de verdad ha llegado al driver, ANTES de intentar
     * nada. Esta linea existe por una tarde entera de rondas preguntandonos dos
     * cosas que el log no contestaba: "¿la imagen que corre es la nueva?" y
     * "¿el env llego hasta aqui?". Ahora las dos se leen de un vistazo, y ADEMAS
     * cambia cuando cambia el codigo, que es justo lo que el sello de build no
     * hace. Un chivato de configuracion vale mas que uno de resultado. */
    /* ⚠️ EL RELOJ, EL EFECTIVO. Antes se imprimía `pines.khz`, que es lo que
     * PIDE el env — y con el env vacío eso sale «0 kHz», que no es ninguna
     * velocidad. Costó dar por buena una prueba del bus sin saber a qué
     * frecuencia se había hecho (15-ago): 2 MB ida y vuelta sin una diferencia,
     * y el log diciendo «0».
     *
     * El driver resuelve `khz > 0 ? khz : SDIO_KHZ_POR_DEFECTO`, así que aquí se
     * hace la misma cuenta y se dice de DÓNDE sale. Un chivato de configuración
     * que declara un valor imposible es peor que no tenerlo: éste es el fichero
     * donde se decide a qué velocidad va el bus, y esa decisión —dice su propio
     * comentario— «se toma MIDIENDO, no por optimismo». Sin este dato no se
     * puede anotar la medida. */
    log_printf("sd: SDIO slot %d, %d bit(s), clk %d cmd %d d0 %d | pwr %d (activo %s) | ldo %d | %d kHz (%s)",
               pines.slot, pines.ancho, pines.clk, pines.cmd, pines.d0,
               pines.pwr, pines.pwr_activo_alto ? "alto" : "bajo",
               pines.ldo,
               pines.khz > 0 ? pines.khz : SDIO_KHZ_POR_DEFECTO,
               pines.khz > 0 ? "del env" : "por defecto");

    if (bpvm_fs_fat_montar(bpvm_blk_sdmmc(&pines), "/sd", motivo, sizeof motivo) == 0) {
        log_printf("sd: montada en /sd (%d bits, particion en el bloque %u)",
                   pines.ancho, (unsigned) bpvm_fs_fat_lba_particion());
    } else {
        log_printf("sd: NO montada - %s", motivo);
    }
}

