legio-e/BasicPlus/bpgenvm-c/esp32p4/main/main.c
#ifdef BPVM_P4_WIRE_TCP
/* ---- Servidor del wire v1: la VM corre AQUÍ (stack holgado). ----
 * Prepara FS + stdlib (independiente del canal de log), abre el socket de
 * escucha y entra al bucle del REPL reutilizado. No retorna. */
static void wire_task(void *arg)
{
    (void) arg;
    xEventGroupWaitBits(s_events, LINK_UP_BIT, pdFALSE, pdTRUE, portMAX_DELAY);

    /* H9 — arranque escalonado (particiones del env → FS → VM). Sin FS el climb
     * se queda abajo y el host conduce; stdlib solo con el FS montado. */
    board_mgr_esp32_boot();
    const bpvm_boot_status_t* bs = board_boot_status();
    if (bs->state >= BPVM_BOOT_FS) { fs_register_bpvm(); esp32_mods_install(); }
    if (bs->state >= BPVM_BOOT_FS) p4_montar_sd();   /* V5/H6 */
    /* V5/H7 — mapear la zona de packs y DECIR sus direcciones. Se hace
     * aunque no haya pack grabado: con `0 candidatos` el log ya deja el
     * dato que el IDE necesita para SELLAR uno (la direccion la asigna la
     * MMU en runtime, o sea que no se puede saber desde el PC). */
    /* V5/H7 (16-ago) - el arranque MAPEA la zona (barato, y el IDE la necesita
     * ya); BUSCAR el ancla y SALTAR se hace en el primer `Run`, como en la
     * Pico. Antes aquí se hacía todo: 338 ms de cada arranque, y el único paso
     * que puede colgar puesto justo donde un cuelgue obliga a regrabar. */
    if (bs->state >= BPVM_BOOT_FS) {
        (void) pack_p4_mapear();
        repl_set_packs_loader(pack_p4_cargar);
    }
    net_logf("[p4] boot estado %d (%s)%s, %d ficheros",
             (int) bs->state, bpvm_boot_state_name(bs->state),
             bs->degraded ? " DEGRADADO" : "", fs_file_count());

    esp32_hw_register();         /* H14: backends GPIO/UART/SPI/I2C (reúso del S3, ESP-IDF) */
    p4_install_board_id();       /* INFO/HELLO esp32p4 + Pico.* backend del P4 (pisa el del S3) */
    wire_v1_tcp_server_init(WIRE_PORT);
    net_logf("[p4] VM.3: esperando al IDE en *:%d (backend 'VM (TCP v1)' -> 192.168.2.2:%d)",
             WIRE_PORT, WIRE_PORT);

    /* bucle del REPL (accept/reconnect en wire_v1_recv_line). H9: autorun solo
     * con la placa sana en estado 3. */
    if (bs->state == BPVM_BOOT_APP && !bs->degraded) repl_esp32_autorun();
    repl_esp32_run();            /* no retorna */
}

#else   /* !BPVM_P4_WIRE_TCP — transporte por defecto */

/* ===== Transporte UART0 (#138): el IDE conecta al puerto del bridge USB-UART, SIN
 * red → sirve también a placas sin Ethernet (la nueva con pantalla). Gemelo de
 * wire_task: mismo FS+stdlib+HW y el mismo repl_esp32_run reutilizado, pero NO
 * espera Link Up y arranca wire_v1_transport_init en vez del servidor TCP. ===== */
static void wire_task_uart(void *arg)
{
    (void) arg;
    /* Espera Link Up (con timeout) para que net_logf (red de seguridad) llegue al
     * PC antes de arrancar. Si la placa no tiene Ethernet, tras el timeout arranca
     * igual (sin logs por red). */
#if BPVM_P4_NETLOG
    xEventGroupWaitBits(s_events, LINK_UP_BIT, pdFALSE, pdTRUE, pdMS_TO_TICKS(5000));
#endif

    board_mgr_esp32_boot();
    const bpvm_boot_status_t* bs = board_boot_status();
    if (bs->state >= BPVM_BOOT_FS) { fs_register_bpvm(); esp32_mods_install(); }
    if (bs->state >= BPVM_BOOT_FS) p4_montar_sd();   /* V5/H6 */
    /* V5/H7 — mapear la zona de packs y DECIR sus direcciones. Se hace
     * aunque no haya pack grabado: con `0 candidatos` el log ya deja el
     * dato que el IDE necesita para SELLAR uno (la direccion la asigna la
     * MMU en runtime, o sea que no se puede saber desde el PC). */
    /* V5/H7 (16-ago) - el arranque MAPEA la zona (barato, y el IDE la necesita
     * ya); BUSCAR el ancla y SALTAR se hace en el primer `Run`, como en la
     * Pico. Antes aquí se hacía todo: 338 ms de cada arranque, y el único paso
     * que puede colgar puesto justo donde un cuelgue obliga a regrabar. */
    if (bs->state >= BPVM_BOOT_FS) {
        (void) pack_p4_mapear();
        repl_set_packs_loader(pack_p4_cargar);
    }
    net_logf("[p4] boot estado %d (%s)%s (UART), %d ficheros",
             (int) bs->state, bpvm_boot_state_name(bs->state),
             bs->degraded ? " DEGRADADO" : "", fs_file_count());

    esp32_hw_register();         /* H14: backends GPIO/UART/SPI/I2C (reúso del S3) */
    p4_install_board_id();       /* INFO/HELLO esp32p4 + Pico.* del P4 */
    wire_v1_transport_init();
    net_logf("[p4] VM.3 (UART0): wire v1 por el bridge USB-UART; conecta el IDE");

    /* #423 — A PARTIR DE AQUI, EL LOG LO MANDA EL ENTORNO (`log=0|1`).
     *
     * El arranque entero queda registrado SIEMPRE: son unas quince lineas y no
     * llenan nada, y son justo las que hacen falta cuando una placa no arranca.
     * Lo que se apaga es el rastro de EJECUCION — el que llena la region de
     * 8 KB en ~26 colectas del GC y hacia que un cuelgue no dejara su ultimo
     * momento escrito (#423).
     *
     * Por defecto APAGADO: se enciende con `log=1` en el entorno cuando se va a
     * depurar, que es lo que pidio Eduardo. Para moverlo mas arriba, basta con
     * subir esta llamada: todo lo que quede por encima se registra siempre. */
    /* `stack=N` (KB) — el usuario reparte el bloque entre pilas y heap;
     * ausente o 0 = el reparto de siempre. Mismo sitio y misma clave que
     * en las otras familias: la regla vive en bpvm_stack_region_bytes(). */
    bpvm_set_stack_kb((unsigned long) bpvm_env_get_long(board_mgr_env(), "stack", 0));
    bpvm_set_quantum_ops(bpvm_env_get_long(board_mgr_env(), "quantum", 0));   /* #462 */
    bpvm_log_set_enabled(bpvm_env_get_bool(board_mgr_env(), "log", 0));

    if (bs->state == BPVM_BOOT_APP && !bs->degraded) repl_esp32_autorun();  /* H9 */
    repl_esp32_run();            /* no retorna */
}

#endif  /* BPVM_P4_WIRE_TCP */

/* Reserva el heap de la VM en PSRAM. El P4 SIEMPRE lleva PSRAM (in-package, la
 * comparte con el framebuffer del display); si la reserva falla el firmware no es
 * operativo → abort con mensaje claro (mejor que arrancar y colgar luego en el
 * primer programa grande). Los firmwares sin PSRAM (S3/Pico/STM32) mantienen su
 * buffer en SRAM; esto es board-specific del P4. */
/*
 * V5/H7 — EL BLOQUE DE LA BD, Y MUERDE PRIMERO.
 *
 * Va ANTES de `vm_buffer_init_psram()` y no es una preferencia: es lo que hace
 * que su dirección sea DETERMINISTA. El pack nativo de SQLite se realoja en el
 * PC para una dirección concreta y lleva ese SELLO dentro (`linked_ram`); si el
 * bloque saliera de lo que quedara libre, lo daría el alocador y podría cambiar
 * entre arranques — y un pack ya grabado funcionaría una vez y luego no, sin
 * patrón. Es la misma regla que la Metro: *la BD muerde primero*.
 *
 * El tamaño sale del env (`SQLite=<MB>`) y la regla de cuánto se reserva vive en
 * `bpvm_sqlmem` — un solo sitio para el arranque, el INFO y el IDE. Por eso hay
 * que leer el env ANTES, con `board_mgr_esp32_env_temprano()`: el arranque
 * escalonado corre mucho después (ver el porqué largo en `board_mgr_esp32.c`).
 *
 * No reservar NO es un fallo: es la respuesta correcta si nadie pidió BD. Pero
 * se dice en el log SIEMPRE y con el motivo, porque "no se pidió", "se pidió
 * poco" y "no cupo" mandan a sitios distintos.
 */
static void vm_sqlite_init_psram(void)
{
    board_mgr_esp32_env_temprano();
    s_sqlite_asked_mb = bpvm_env_get_long(board_mgr_env(), "SQLite", 0);

    size_t freeps  = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);
    size_t sqlbytes = 0;
    bpvm_sqlite_res_t r = bpvm_sqlite_region(s_sqlite_asked_mb, freeps, &sqlbytes);
    s_sqlite_res = (int) r;

    if (r != BPVM_SQLITE_OK) {
        log_printf("bd: SIN bloque — %s (SQLite=%ld en el ENV, PSRAM libre %u KB)",
                   bpvm_sqlite_res_str(r), s_sqlite_asked_mb,
                   (unsigned) (freeps / 1024u));
        return;
    }

