legio-e/BasicPlus/bpgenvm-c/esp32p4/main/main.c
    /*
     * ALINEADO A PÁGINA, y las dos razones son distintas:
     *
     * 1. CORRECCIÓN. Las secciones `.data`/`.sdata` del pack piden alineación 8
     *    (lo dice su ELF) y ahí viven estructuras de SQLite con `double` y
     *    enteros de 64 bits. `heap_caps_malloc` devuelve alineado a 4: el primer
     *    arranque dio 0x48000a7c, que NO es múltiplo de 8. El Pico ya lo hacía
     *    (`& ~7u`, "porque ahí van estructuras del pack") y al portarlo se me
     *    quedó fuera.
     *
     * 2. ESTABILIDAD DEL SELLO, que es lo que de verdad importa. Ese 0xa7c de
     *    desplazamiento es de lo que la IDF reservara en PSRAM ANTES que
     *    nosotros; si un día eso crece o mengua, nuestra dirección se mueve y el
     *    pack grabado deja de valer. Pidiendo página (4 KB), el alocador
     *    redondea hacia arriba y una variación pequeña de lo que hay delante
     *    YA NO NOS MUEVE — sólo saltaría de página si el cambio pasara de 4 KB.
     *    No es una garantía absoluta (no existe con un alocador de por medio),
     *    pero convierte "frágil ante cualquier byte" en "estable salvo cambio
     *    grande". Y si aun así se moviera, el SELLO lo caza y lo dice.
     */
    s_sqlite_base = (uint8_t*) heap_caps_aligned_alloc(4096, sqlbytes, MALLOC_CAP_SPIRAM);
    if (s_sqlite_base == NULL) {
        /* Pedirlo y no conseguirlo NO se traga: la regla dijo que cabía y el
         * alocador dice que no, y esa discrepancia hay que verla. La VM sigue
         * arrancando (sin BD), que es mejor que abortar por una función opcional. */
        s_sqlite_res = (int) BPVM_SQLITE_NO_CABE;
        log_printf("bd: la regla daba %u KB pero heap_caps_malloc DIJO QUE NO "
                   "(PSRAM libre %u KB) — se sigue SIN BD",
                   (unsigned) (sqlbytes / 1024u), (unsigned) (freeps / 1024u));
        return;
    }
    s_sqlite_size   = (uint32_t) sqlbytes;
    /* La RAM del pack sale del PRINCIPIO de este bloque: `[estáticos | arena]`. */
    s_pack_ram_base = s_sqlite_base;

    log_printf("bd: bloque %u KB @%p (SQLite=%ld MB) | pack %u B delante, arena %u KB",
               (unsigned) (sqlbytes / 1024u), (void*) s_sqlite_base, s_sqlite_asked_mb,
               (unsigned) PACK_RAM_BYTES,
               (unsigned) ((sqlbytes - PACK_RAM_BYTES) / 1024u));
}

/* V6/U6.10 — LO QUE EL P4 OFRECE: la PSRAM, EXCLUSIVA de la VM, con un MARGEN de
 * region: los 4 MiB que se dejan LIBRES para que LVGL los pida despues, on-demand.
 * La reserva de SQLite no entra aqui: se asigna APARTE y antes (vm_sqlite_init_psram,
 * alineada a pagina por el sello del pack), asi que el enumerador ya la ve gastada.
 * `bytes` es el bloque contiguo mayor —lo unico que un malloc puede dar—, y por eso
 * la escalera de -1 MiB de antes casi nunca tendra que bajar: el plan ya parte del
 * contiguo, no del total. */
static int p4_mem_regiones(bpvm_mem_region_t* out, int max, multi_heap_info_t* hi) {
    if (max < 1) return 0;
    heap_caps_get_info(hi, MALLOC_CAP_SPIRAM);
    out[0].base      = NULL;
    out[0].bytes     = hi->largest_free_block;
    out[0].libre     = hi->total_free_bytes;
    out[0].exclusiva = 1;
    out[0].margen    = VM_PSRAM_DISPLAY_RESERVE;
    out[0].nombre    = "PSRAM";
    return 1;
}

static void vm_buffer_init_psram(void)
{
    /* V6/U6.10 — ENUMERAR, PLANIFICAR, TOMAR: la misma regla que la Pico (U6.8) y
     * el S3/C3 (U6.9), en su rama exclusiva. Antes: toda la PSRAM libre menos la
     * reserva del display, reintentando -1 MiB si la mayor no cabia. Ahora el
     * comun decide (test_mem lo cubre como «exclusiva con margen») y aqui queda
     * TOMAR: alineado a pagina y con la escalera por si el asignador discrepa. */
    multi_heap_info_t hi;
    bpvm_mem_region_t reg[1];
    int nreg = p4_mem_regiones(reg, 1, &hi);
    log_printf("psram: libre %u KB | mayor %u KB | bloques: %u libres, %u usados",
               (unsigned)(hi.total_free_bytes / 1024u), (unsigned)(hi.largest_free_block / 1024u),
               (unsigned) hi.free_blocks, (unsigned) hi.allocated_blocks);

    bpvm_mem_cfg_t cfg;
    cfg.objetivo = 0;                 /* la VM toma todo lo que el plan deje */
    cfg.vm_min   = VM_MEM_MIN;        /* piso si algo va mal */
    cfg.reserva_bytes = 0; cfg.reserva_nombre = NULL;   /* SQLite va aparte, y ya esta tomada */

    bpvm_mem_plan_t plan;
    bpvm_mem_plan(reg, nreg, &cfg, &plan);
    char linea[160];
    bpvm_mem_plan_str(&plan, reg, &cfg, linea, sizeof linea);
    log_printf("%s", linea);

    size_t want = (plan.res == BPVM_MEM_OK) ? (plan.bytes & ~((size_t) 4095u)) : 0u;
    s_vm_buffer = NULL;
    while (want >= VM_MEM_MIN) {
        s_vm_buffer = (uint8_t*) heap_caps_malloc(want, MALLOC_CAP_SPIRAM);
        if (s_vm_buffer != NULL) break;
        want -= 1024u * 1024u;
    }
    if (s_vm_buffer == NULL) {
        ESP_LOGE(TAG, "PSRAM: no se pudo reservar el heap de la VM (%s) - abort", linea);
        abort();
    }
    s_vm_buffer_size = (uint32_t) want;
    ESP_LOGI(TAG, "VM heap en PSRAM: %u KiB (reserva display %u KiB, PSRAM libre %u KiB) @ %p",
             (unsigned)(want / 1024u), (unsigned)(VM_PSRAM_DISPLAY_RESERVE / 1024u),
             (unsigned)(hi.total_free_bytes / 1024u), (void*) s_vm_buffer);
    /* #329 — al log PERSISTENTE tambien, con el mismo formato que el S3: la
     * consola se pierde al desconectar y las dos placas tienen que contar lo
     * mismo para poder compararlas (que es justo lo que pide #328). Aqui ademas
     * interesa la DRAM INTERNA, no la PSRAM: el heap de la VM vive fuera, pero
     * littlefs y el wire siguen tirando de la interna. */
    log_printf("vm: heap %u KB en PSRAM @%p (PSRAM libre %u KB) | DRAM interna libre %u B (bloque mayor %u B)",
               (unsigned)(want / 1024u), (void*) s_vm_buffer,
               (unsigned)(heap_caps_get_free_size(MALLOC_CAP_SPIRAM) / 1024u),
               (unsigned) heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT),
               (unsigned) heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
}

/* #353 — sink de diagnóstico de la VM: al log persistente.
 *
 * ⚠️ Esto FALTABA en el P4, y era la única familia sin ponerlo — el S3 lo tiene
 * en su main.c y el STM32 en su repl. Consecuencia, medida el 15-ago con
 * Eduardo: en esta placa había log de ARRANQUE (lo escribe este fichero con
 * `log_printf`) pero NINGUNO de ejecución. Todo lo que dice la VM mientras corre
 * un programa —de dónde salió cada módulo, qué dependencia no encontró, el
 * veredicto del guardián de fin de RUN— se iba al `stderr` por defecto, que aquí
 * es la consola USB-JTAG: un sitio que nadie mira y que además no sobrevive al
 * reset.
 *
 * El coste real de no tenerlo: una mañana entera de hipótesis sobre por qué un
 * `Core.mod` en `/lib` daba «IO error», con el firmware sabiendo la respuesta y
 * contándosela a nadie. */
static void diag_al_log(const char* linea) { log_printf("%s", linea); }

