legio-e/BasicPlus/bpgenvm-c/esp32p4/main/main.c
void app_main(void)
{
    /* LO PRIMERO: el log persistente. Recupera el snapshot de la sesión anterior
     * (post-mortem: si el arranque previo se fue al garete, aquí está escrito) y
     * queda grabando desde antes de la PSRAM y del climb del boot — vive en RAM
     * interna + un sector libre de bpenv, así que no depende de ninguno. */
    log_init();
    bpvm_diag_set_sink(diag_al_log);           /* #353 — FALTABA en esta familia */
    log_printf("=== boot ESP32-P4 ===");
    /* #439 — DE DONDE sale lo que trae el log. Sin esto, un volcado con dos
     * arranques no distingue «la RAM sobrevivio» de «se cargo de flash lo que
     * el arranque anterior volco» — que es exactamente lo que habia antes.
     * Estaba solo en la Pico: el mecanismo viajo a las 4 imagenes y el AVISO
     * no. Un arreglo a medias es el que no se puede comprobar. */
    log_printf(bpvm_log_origen_ram()
               ? "log: RAM SUPERVIVIENTE (lineas de ANTES del reset)"
               : "log: arranque en frio (cargado de flash)");


    /* V5/H7 — el bloque de la BD muerde ANTES que el heap de la VM: su dirección
     * va SELLADA dentro del pack nativo y tiene que ser la misma cada arranque.
     * Ver el porqué en vm_sqlite_init_psram(). */
    vm_sqlite_init_psram();

    /* Heap de la VM en PSRAM (común a todos los transportes), con lo que quede. */
    vm_buffer_init_psram();

    /* La tabla BIOS se verifica SIEMPRE, haya pack o no: así un hueco se
     * descubre hoy y no el día que alguien grabe uno. El que la usa es el pack,
     * por el ancla; esto sólo comprueba.
     *
     * Y DICE QUE SÍ, no sólo que no. `bios_p4_get()` ya escribe cuál ranura
     * falta cuando falla, pero callar al ir bien deja un silencio ambiguo: no
     * distingue "completa" de "esta línea no se ejecutó". En un arranque nuevo
     * eso es justo lo que hay que poder distinguir. */
    log_printf("bios: tabla %s (%d ranuras)",
               bios_p4_get() ? "COMPLETA" : "INCOMPLETA", bpvm_bios_slot_count());

    s_events = xEventGroupCreate();

#if BPVM_P4_NETLOG
    /* Ethernet — COMÚN: en TCP transporta el wire; en UART transporta SOLO los logs
     * (net_logf → :5555) como red de seguridad. B.5 (#138, 2-jul): NO-FATAL — si la
     * placa no tiene PHY (una P4 sin Ethernet), eth_init falla y seguimos SIN red
     * (sin logs :5555; el wire UART no depende de él). wire_task_uart ya tolera la
     * ausencia: espera Link Up con timeout de 5 s y arranca igual. */
    esp_eth_handle_t eth_handle = NULL;
    esp_err_t eth_rc = eth_init(&eth_handle);
    if (eth_rc == ESP_OK) {
        ESP_ERROR_CHECK(esp_netif_init());
        ESP_ERROR_CHECK(esp_event_loop_create_default());

        esp_netif_config_t cfg = ESP_NETIF_DEFAULT_ETH();
        esp_netif_t *eth_netif = esp_netif_new(&cfg);
        esp_eth_netif_glue_handle_t glue = esp_eth_new_netif_glue(eth_handle);
        ESP_ERROR_CHECK(esp_netif_attach(eth_netif, glue));

        esp_netif_dhcpc_stop(eth_netif);
        esp_netif_ip_info_t ip = {0};
        esp_netif_set_ip4_addr(&ip.ip,      192, 168, 2, 2);
        esp_netif_set_ip4_addr(&ip.gw,      192, 168, 2, 1);
        esp_netif_set_ip4_addr(&ip.netmask, 255, 255, 255, 0);
        ESP_ERROR_CHECK(esp_netif_set_ip_info(eth_netif, &ip));

        ESP_ERROR_CHECK(esp_event_handler_register(ETH_EVENT, ESP_EVENT_ANY_ID,
                                                   &eth_event_handler, NULL));
        ESP_ERROR_CHECK(esp_event_handler_register(IP_EVENT, IP_EVENT_ETH_GOT_IP,
                                                   &got_ip_handler, NULL));
        ESP_ERROR_CHECK(esp_eth_start(eth_handle));

        /* Canal de log (diagnóstico) — común a ambos transportes. */
        xTaskCreate(tcp_log_task, "tcp_log", 4096, NULL, 5, NULL);
    } else {
        ESP_LOGW(TAG, "Ethernet no disponible (%s) — sigo sin red: logs :5555 desactivados",
                 esp_err_to_name(eth_rc));
#ifdef BPVM_P4_WIRE_TCP
        ESP_LOGE(TAG, "wire TCP configurado SIN Ethernet: el IDE no podra conectar "
                      "(compila con BPVM_P4_WIRE=uart para esta placa)");
#endif
    }
#endif  /* BPVM_P4_NETLOG */

#ifdef BPVM_P4_WIRE_TCP
    /* Wire por TCP. */
    xTaskCreate(wire_task, "wire_v1", 32768, NULL, 5, NULL);
    ESP_LOGI(TAG, "P4 VM.3 (TCP): IP 192.168.2.2 | log %s:%d | wire v1 TCP *:%d",
             SERVER_IP, SERVER_PORT, WIRE_PORT);
#else
    /* Wire por UART0 (COM14) + Ethernet SOLO para logs (:5555) = red de seguridad. */
    xTaskCreate(wire_task_uart, "wire_uart", 32768, NULL, 5, NULL);
    ESP_LOGI(TAG, "P4 VM.3 (UART0 + Ethernet-logs): wire por COM14, logs por :5555");
#endif

    /* G6 — la GUI la dirige BasicPlus: cuando un .mod usa Gui.*, gui.c hace lv_init()
     * + bpvm_gui_disp_init() (costura en gui_display_dsi.c) y Gui.run() bombea, todo
     * dentro del VM (wire_task). El panel/táctil arrancan en ese momento; app_main
     * solo deja red + tasks listas. (p4_gfx_lvgl_test/smoke quedan de diagnóstico.) */
}
